{
  "backend/main.mo": "Motoko canister implementing a trucking logistics backend with data models for customers, shipments, bookings, and tracking, plus APIs to estimate quotes, create bookings, retrieve bookings, and update shipment tracking using in-canister storage.",
  "feature_evidence.json": "Machine-readable report listing implemented frontend features, the files and components involved, associated test requirements, and confidence levels for UI motion, interactivity, and form feedback enhancements.",
  "frontend-file-summaries.txt": "Prewritten JSON-style map providing concise summaries of all major frontend source files, components, hooks, pages, and styles for documentation and planning purposes.",
  "frontend/index.html": "Base HTML entry point that defines the root DOM node and loads the React application via the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that manages client-side navigation state between Home, Quote, Booking, and Tracking pages, passes optional pre-selected service types, and applies page transition animations.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company branding, services list, contact information, and attribution with responsive layout and icons.",
  "frontend/src/components/FormFieldError.tsx": "Reusable inline form error component that conditionally renders an accessible alert with an error icon and message.",
  "frontend/src/components/Header.tsx": "Responsive header with company branding and navigation controls, supporting desktop buttons and a toggleable mobile menu.",
  "frontend/src/components/InlineBanner.tsx": "Configurable banner component for success, error, or info messages, supporting icons, dismiss actions, and optional call-to-action buttons.",
  "frontend/src/components/MotionSection.tsx": "Wrapper component that animates its children into view when first scrolled into the viewport, using a custom intersection observer hook and optional delay.",
  "frontend/src/components/ServiceDetailsDialog.tsx": "React dialog component that displays detailed information for a selected shipping service, including inclusions, ideal use cases, and timelines. It maps service titles to predefined metadata and provides navigation callbacks to quote and booking flows.",
  "frontend/src/components/TrackingResultsSkeleton.tsx": "UI skeleton component that renders placeholder cards and timelines while shipment tracking data is loading. Uses reusable Card and Skeleton components to mimic the final tracking layout.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor using React Query, handling authenticated and anonymous identities. It initializes access control when available and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for Internet Identity, managing login, logout, identity persistence, and login status. Wraps the app to expose identity state and AuthClient-based login helpers via a React context.",
  "frontend/src/hooks/useInViewOnce.ts": "Utility hook that uses IntersectionObserver to detect when an element enters the viewport once. It respects reduced-motion preferences and exposes a ref and boolean flag for animation triggers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with the backend actor, including estimating quotes, creating bookings, tracking shipments, and fetching booking details. Each hook handles actor availability and query invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, light and dark theme variables, base styles, and utility classes. Includes reduced-motion support and interactive UI state helpers.",
  "frontend/src/main.tsx": "Frontend entry point that initializes React, sets up the React Query client, and wraps the app with InternetIdentity and QueryClient providers. Imports global styles and mounts the App component to the DOM.",
  "frontend/src/pages/BookingPage.tsx": "Implements the shipment booking form that collects customer, pickup/delivery, and shipment details, validates inputs, and calls a createBooking mutation to generate a shipment ID with confirmation UI.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with hero content, service cards, and CTAs that navigate to quote, booking, or tracking, including a dialog for service details.",
  "frontend/src/pages/QuotePage.tsx": "Provides a quote estimation form for shipment details, validates input, calls an estimateQuote mutation, and displays the resulting price estimate with success/error states.",
  "frontend/src/pages/TrackingPage.tsx": "Implements shipment tracking by ID, calling a trackShipment query and rendering current status, timeline entries, copy-to-clipboard, and expandable details.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, container settings, extended color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Captures high-level project state, schema versioning, and a structured list of implemented features describing the logistics website’s core flows and architecture."
}